{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_5",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense9",
            "trainable": true,
            "batch_input_shape": [
              null,
              10
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 9,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense10",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 2.0.0",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v2.0.0",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": [
        "https://github.com/slavikse/syntet/public/models/syntet_TicTacToe_model_X.weights.bin"
      ],
      "weights": [
        {
          "name": "dense_Dense9/kernel",
          "shape": [
            10,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense9/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense10/kernel",
          "shape": [
            128,
            9
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense10/bias",
          "shape": [
            9
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
